In [9]:
import numpy as np
import pandas as pd

In [10]:
df= pd.DataFrame({
    'key':['a','b','c','a','b','c'],
    'data':range(6)
})
df

  key  data
0   a     0
1   b     1
2   c     2
3   a     3
4   b     4
5   c     5

In [11]:
df.groupby('key')

In [12]:
df.groupby('key').sum()

     data
key
a       3
b       5
c       7

In [13]:
df.groupby(['key','data']).sum()

Empty DataFrame
Columns: []
Index: [(a, 0), (a, 3), (b, 1), (b, 4), (c, 2), (c, 5)]

In [14]:
df.groupby('key').aggregate(['min', np.median, max])

    data
     min median max
key
a      0    1.5   3
b      1    2.5   4
c      2    3.5   5

In [18]:
df.groupby('key').aggregate({
    'data':min
})

     data
key
a       0
b       1
c       2

In [19]:
def filter_by_mean(x):
    return x['data'].mean()>3

In [20]:
df.groupby('key').mean()

     data
key
a     1.5
b     2.5
c     3.5

In [21]:
df.groupby('key').filter(filter_by_mean)

  key  data
2   c     2
5   c     5

In [28]:
df

  key  data
0   a     0
1   b     1
2   c     2
3   a     3
4   b     4
5   c     5

In [23]:
#apply : groupby를 통해서 묶인 데이터에 함수 적용
df.groupby('key').apply(lambda x: x.max()-x.min())

     data
key
a       3
b       3
c       3

In [29]:
import numpy as np
import pandas as pd

df = pd.DataFrame({
'key': ['A', 'B', 'C', 'A', 'B', 'C'],
'data1': [0, 1, 2, 3, 4, 5],
'data2': [4, 4, 6, 0, 6, 1]
})
print("DataFrame:")
print(df, "\n")

# aggregate를 이용하여 요약 통계량을 산출해봅시다.
# 데이터 프레임을 'key' 칼럼으로 묶고, data1과 data2 각각의 최솟값, 중앙값, 최댓값을 출력하세요.


# 데이터 프레임을 'key' 칼럼으로 묶고, data1의 최솟값, data2의 합계를 출력하세요.

DataFrame:
  key  data1  data2
0   A      0      4
1   B      1      4
2   C      2      6
3   A      3      0
4   B      4      6
5   C      5      1

In [31]:
# aggregate를 이용하여 요약 통계량을 산출해봅시다.
# 데이터 프레임을 'key' 칼럼으로 묶고, data1과 data2 각각의 최솟값, 중앙값, 최댓값을 출력하세요.
df.groupby('key').aggregate([min, np.median, max])

    data1            data2
      min median max   min median max
key
A       0    1.5   3     0    2.0   4
B       1    2.5   4     4    5.0   6
C       2    3.5   5     1    3.5   6

In [35]:
# 데이터 프레임을 'key' 칼럼으로 묶고, data1의 최솟값, data2의 합계를 출력하세요.
df.groupby('key').aggregate('data1': min , 'data2':sum)

SyntaxError: invalid syntax (<ipython-input-35-7bd4ba5e1a8f>, line 2)

In [36]:
df.groupby('key').aggregate({
    'data1':min,
    'data2':sum
})

     data1  data2
key
A        0      4
B        1     10
C        2      7